{"id": "24017920-bab4-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-29T12:58:25.476Z", "updated_by": "elastic", "created_at": "2024-01-24T12:28:55.611Z", "created_by": "elastic", "name": "NETXP LINUX Mount/Unmount syscall on Linux machine", "tags": [], "interval": "5m", "enabled": false, "revision": 1, "description": "This rule is configured to monitor mount and unmount operations on a Linux system. It generates audit events whenever the mount or umount2 system calls are executed, specifically on 64-bit architectures. The rule excludes events where the audit user ID is unknown (auid!=-1). The key \"mount\" is assigned to the generated events for easy identification and tracking.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "493386b6-30cb-42eb-bfd3-57e99a8e2824", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where aditd.log.key: \"*mount*\" and \nany where event.module: \"auditd\"\n\n\n//czeka na nowy plik konfiguracyjny", "filters": [], "actions": []}