{"id": "95a1df40-b9ef-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-26T08:59:32.213Z", "updated_by": "elastic", "created_at": "2024-01-23T13:01:55.384Z", "created_by": "elastic", "name": "NETXP TI DNS resolved to malicious IP/Domain", "tags": [], "interval": "1h", "enabled": true, "revision": 4, "description": "Rule within a security framework actively monitors DNS resolution processes, pinpointing instances where domain names are translated into IP addresses that have been flagged as malicious or associated with nefarious activities. By scrutinizing DNS resolution events, this rule provides a valuable layer of defense against potential threats, enabling the timely detection of connections to known malicious entities. This proactive approach empowers organizations to fortify their cybersecurity posture by swiftly responding to and mitigating risks associated with compromised domains or IP addresses", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "5m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-3900s", "rule_id": "ee58d4cb-f20c-418b-a2b3-013525895681", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [{"id": "3750d770-bc29-11ee-9eba-5b4cdffa10fc", "list_id": "c3217659-2642-4d30-a4c3-8d675b8b20e0", "type": "rule_default", "namespace_type": "single"}], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "threat_match", "language": "kuery", "index": ["logs-*"], "query": "dns.question.name : * OR dns.resolved_ip: * AND network.protocol : \"dns\"", "filters": [], "threat_filters": [], "threat_query": "@timestamp >= \"now-30d/d\"", "threat_mapping": [{"entries": [{"field": "dns.question.name", "type": "mapping", "value": "threat.indicator.url.domain"}]}, {"entries": [{"field": "dns.resolved_ip", "type": "mapping", "value": "threat.indicator.ip"}]}], "threat_language": "kuery", "threat_index": ["logs-ti*"], "threat_indicator_path": "threat.indicator", "actions": []}{"_version": "WzQzODc2LDcwXQ==", "created_at": "2024-01-26T08:59:30.279Z", "created_by": "elastic", "description": "Exception list containing exceptions for rule with id: 95a1df40-b9ef-11ee-9eba-5b4cdffa10fc", "id": "3750d770-bc29-11ee-9eba-5b4cdffa10fc", "immutable": false, "list_id": "c3217659-2642-4d30-a4c3-8d675b8b20e0", "name": "Exceptions for rule - NETXP TI DNS resolved to malicious IP/Domain", "namespace_type": "single", "os_types": [], "tags": ["default_rule_exception_list"], "tie_breaker_id": "cf401ea1-7839-4296-91e6-4a153cb50198", "type": "rule_default", "updated_at": "2024-01-26T08:59:30.279Z", "updated_by": "elastic", "version": 1, "author": ["Szymon Gluch"]}{"_version": "WzQzODk0LDcwXQ==", "comments": [], "created_at": "2024-01-26T10:28:13.182Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "dns.question.registered_domain", "operator": "included", "type": "match", "value": "google.com"}], "id": "9c0361e0-bc35-11ee-9eba-5b4cdffa10fc", "item_id": "0a0c1fe2-8f0d-461d-b30b-9fbb9d49a5b3", "list_id": "c3217659-2642-4d30-a4c3-8d675b8b20e0", "name": "google domain", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "8718173d-8907-409e-9292-cc0c700b0269", "type": "simple", "updated_at": "2024-01-26T10:28:13.182Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"_version": "WzQzODkzLDcwXQ==", "comments": [], "created_at": "2024-01-26T10:27:27.022Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "dns.question.name", "operator": "included", "type": "match", "value": "t.co"}], "id": "807fece0-bc35-11ee-9eba-5b4cdffa10fc", "item_id": "01d1a248-4fc6-448d-a1d6-967f73ccc4d0", "list_id": "c3217659-2642-4d30-a4c3-8d675b8b20e0", "name": "twitter domain", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "9f9a244c-dd4b-4249-8f63-6bde23e6a651", "type": "simple", "updated_at": "2024-01-26T10:27:27.022Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"_version": "WzQzODc3LDcwXQ==", "comments": [{"comment": "cdn discorda - moze byc malicious, ale to https, zatem nalezy patrzec po stronie hosta", "created_at": "2024-01-26T08:59:32.623Z", "created_by": "elastic", "id": "b2dd839e-00fd-4cc6-9c5a-775f3b6edd8b"}], "created_at": "2024-01-26T08:59:32.623Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "dns.question.name", "operator": "included", "type": "match", "value": "cdn.discordapp.com"}], "id": "38b681f0-bc29-11ee-9eba-5b4cdffa10fc", "item_id": "f6d43bbc-8df0-48c0-845e-1822f897b1d7", "list_id": "c3217659-2642-4d30-a4c3-8d675b8b20e0", "name": "discord cdn", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "c3aac88c-3873-4e4e-a31d-7146a6bc2dc1", "type": "simple", "updated_at": "2024-01-26T08:59:32.623Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"exported_count": 5, "exported_rules_count": 1, "missing_rules": [], "missing_rules_count": 0, "exported_exception_list_count": 1, "exported_exception_list_item_count": 3, "missing_exception_list_item_count": 0, "missing_exception_list_items": [], "missing_exception_lists": [], "missing_exception_lists_count": 0, "exported_action_connector_count": 0, "missing_action_connection_count": 0, "missing_action_connections": [], "excluded_action_connection_count": 0, "excluded_action_connections": [], "author": ["Szymon Gluch"]}