{"id": "b1e59060-bf68-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-30T12:12:34.880Z", "updated_by": "elastic", "created_at": "2024-01-30T12:11:28.430Z", "created_by": "elastic", "name": "NETXP EQL Unapproved local DNS request TEST - moze wywalic duzo alertow", "tags": [], "interval": "5m", "enabled": true, "revision": 1, "description": "TEST", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "2aa0baf3-4fe5-4f90-9323-10cd1856393e", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-suricata.eve-default"], "query": "network where dns.question.name: \"**\" and network.protocol: \"dns\" and destination.address not in (\"192.168.190.115\", \"192.168.190.117\", \"192.168.170.15\", \"192.168.190.25\")\n", "filters": [{"meta": {"disabled": false, "negate": false, "alias": null, "key": "destination.ip", "field": "destination.ip", "params": {"gte": "192.168.0.0", "lt": "192.168.255.255"}, "value": {"gte": "192.168.0.0", "lt": "192.168.255.255"}, "type": "range"}, "query": {"range": {"destination.ip": {"gte": "192.168.0.0", "lt": "192.168.255.255"}}}, "$state": {"store": "appState"}}], "actions": []}{"exported_count": 1, "exported_rules_count": 1, "missing_rules": [], "missing_rules_count": 0, "exported_exception_list_count": 0, "exported_exception_list_item_count": 0, "missing_exception_list_item_count": 0, "missing_exception_list_items": [], "missing_exception_lists": [], "missing_exception_lists_count": 0, "exported_action_connector_count": 0, "missing_action_connection_count": 0, "missing_action_connections": [], "excluded_action_connection_count": 0, "excluded_action_connections": [], "author": ["Szymon Gluch"]}