{"id": "c0bbec60-bacc-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T15:25:06.480Z", "updated_by": "elastic", "created_at": "2024-01-24T15:25:06.480Z", "created_by": "elastic", "name": "NETXP LINUX Register Injection Detected", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors code injection through the ptrace facility, providing visibility into potential security threats. This rule includes events indicating register injection. Detection of such activities is crucial for identifying attempts to manipulate or compromise running processes using the ptrace system call.", "risk_score": 21, "severity": "low", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "eae59d81-8337-4499-b893-23f284c50fd6", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"register_injection\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}