{"id": "04350dd0-baca-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T15:05:31.188Z", "updated_by": "elastic", "created_at": "2024-01-24T15:05:31.188Z", "created_by": "elastic", "name": "NETXP LINUX Reconnaissance Commands used", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors commands that gather system information, helping to identify potential reconnaissance activities. This rule is crucial for detecting initial stages of an attack where adversaries may be probing the system for vulnerabilities, system configuration details, and user information.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "43301003-6bc2-4742-bfbb-e791237b4c7a", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"recon\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}