{"id": "b4879970-b9ec-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-26T09:26:16.207Z", "updated_by": "elastic", "created_at": "2024-01-23T12:41:18.731Z", "created_by": "elastic", "name": "NETXP TI Detected malicious process hash", "tags": [], "interval": "1h", "enabled": true, "revision": 3, "description": "Rule is designed to monitor and identify potentially harmful or malicious activity by comparing cryptographic hash values associated with files, processes, or data against a curated list of known malicious hash signatures. This proactive security measure allows to swiftly detect the presence of files or processes associated with previously identified threats. By leveraging threat intelligence databases, the rule enhances the ability to recognize and respond to cyber threats promptly, contributing to a robust defense against various forms of malware, exploits, or other security risks within a computing environment.", "risk_score": 99, "severity": "critical", "license": "", "output_index": "", "meta": {"from": "5m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-3900s", "rule_id": "21f1f716-9385-48e3-856d-2c8d4073f496", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [{"id": "f3571ee0-bc2c-11ee-9eba-5b4cdffa10fc", "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "type": "rule_default", "namespace_type": "single"}], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "threat_match", "language": "kuery", "index": ["logs-*"], "query": "process.hash.sha256: * OR process.hash.md5: * OR process.hash.sha1: * OR process.pe.imphash: *", "filters": [], "threat_filters": [], "threat_query": "@timestamp >= \"now-30d/d\"", "threat_mapping": [{"entries": [{"field": "process.hash.sha256", "type": "mapping", "value": "threat.indicator.file.hash.sha256"}]}, {"entries": [{"field": "process.hash.md5", "type": "mapping", "value": "threat.indicator.file.hash.md5"}]}, {"entries": [{"field": "process.hash.sha1", "type": "mapping", "value": "threat.indicator.file.hash.sha1"}]}, {"entries": [{"field": "process.pe.imphash", "type": "mapping", "value": "threat.indicator.file.pe.imphash"}]}], "threat_language": "kuery", "threat_index": ["logs-ti*"], "threat_indicator_path": "threat.indicator", "actions": []}{"_version": "WzQzODc4LDcwXQ==", "created_at": "2024-01-26T09:26:14.222Z", "created_by": "elastic", "description": "Exception list containing exceptions for rule with id: b4879970-b9ec-11ee-9eba-5b4cdffa10fc", "id": "f3571ee0-bc2c-11ee-9eba-5b4cdffa10fc", "immutable": false, "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "name": "Exceptions for rule - NETXP TI Detected malicious process hash", "namespace_type": "single", "os_types": [], "tags": ["default_rule_exception_list"], "tie_breaker_id": "35fcdae5-7839-4e2b-8e42-402a29a0aacd", "type": "rule_default", "updated_at": "2024-01-26T09:26:14.223Z", "updated_by": "elastic", "version": 1, "author": ["Szymon Gluch"]}{"_version": "WzQzODk1LDcwXQ==", "comments": [], "created_at": "2024-01-26T14:31:26.422Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "process.pe.imphash", "operator": "included", "type": "match_any", "value": ["f34d5f2d4577ed6d9ceec516c1f5a744", "dae02f32a21e03ce65412f6e56942daa"]}], "id": "96431760-bc57-11ee-9eba-5b4cdffa10fc", "item_id": "bfc97bad-1a61-430f-9170-fd2d3b4a5548", "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "name": "problematic imphashes", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "fc6d1698-8172-48b7-8738-e0ad0d4f9a2c", "type": "simple", "updated_at": "2024-01-26T14:31:26.422Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"_version": "WzQzODkxLDcwXQ==", "comments": [], "created_at": "2024-01-26T10:03:47.003Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "process.hash.sha256", "operator": "included", "type": "match", "value": "46d7e993d18592f2798e08861b764499179f18cff09d3121753a1e0ab0f0456f"}], "id": "321a38b0-bc32-11ee-9eba-5b4cdffa10fc", "item_id": "296a1745-3641-441a-a72f-85916df39d05", "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "name": "pdfs", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "e636585e-78cb-4fce-be04-958e1d7beb18", "type": "simple", "updated_at": "2024-01-26T10:03:47.003Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"_version": "WzQzODg5LDcwXQ==", "comments": [], "created_at": "2024-01-26T09:59:17.422Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "process.name", "operator": "included", "type": "match", "value": "PDFCreator.exe"}], "id": "916b93f0-bc31-11ee-9eba-5b4cdffa10fc", "item_id": "011afebe-3239-4838-89de-9378591ae5f0", "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "name": "pdfcreator", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "d25e76a7-ce16-44db-bc5b-3369de5132c2", "type": "simple", "updated_at": "2024-01-26T09:59:17.423Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"_version": "WzQzODg4LDcwXQ==", "comments": [], "created_at": "2024-01-26T09:57:14.123Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "process.hash.sha256", "operator": "included", "type": "match", "value": "853ff8ef3e1925e54c6df9cea29fe5070e25344e99cbe2b3590c8f2f32c283d4"}], "id": "47ed7db0-bc31-11ee-9eba-5b4cdffa10fc", "item_id": "84a9d793-5077-4146-8485-550d58b14914", "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "name": "selfservice.exe", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "df9cbf84-e8fd-4c6d-883b-d2b1ac7d1fd9", "type": "simple", "updated_at": "2024-01-26T09:57:14.123Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"_version": "WzQzODg3LDcwXQ==", "comments": [], "created_at": "2024-01-26T09:56:39.764Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "process.hash.sha256", "operator": "included", "type": "match", "value": "bc39385214d52aa4fa4cc5d692c15d4e57ef94ae0e8268b494487e56b914999a"}], "id": "3372b940-bc31-11ee-9eba-5b4cdffa10fc", "item_id": "2e95a258-ed3a-4028-aef0-f6a672d6a02e", "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "name": "update.exe", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "20d83579-5efe-4287-b863-f21bb7979c6f", "type": "simple", "updated_at": "2024-01-26T09:56:39.764Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"_version": "WzQzODg2LDcwXQ==", "comments": [], "created_at": "2024-01-26T09:56:00.107Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "process.hash.sha256", "operator": "included", "type": "match", "value": "d87c4ad2481e5c8f33835783568932ef0a8905c8302c9dc5bc38de4839ce5890"}], "id": "1bcf8bb0-bc31-11ee-9eba-5b4cdffa10fc", "item_id": "e0c3c866-1cb9-4dd0-aece-5114652bebfb", "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "name": "pdf-updater-cli", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "6bb2b61b-c68d-4bee-afaa-6b64c8b921a8", "type": "simple", "updated_at": "2024-01-26T09:56:00.107Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"_version": "WzQzODg1LDcwXQ==", "comments": [], "created_at": "2024-01-26T09:55:18.250Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "process.hash.sha256", "operator": "included", "type": "match", "value": "289fd773aaec3ba91dd742d57d69c26fdbbea5d5653ab776f2e04ea5d0240413"}], "id": "02dcaca0-bc31-11ee-9eba-5b4cdffa10fc", "item_id": "0d0ece24-7905-43bc-9ced-35150fc45605", "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "name": "erorr updater", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "1ebfb25a-3cd2-4aea-bb00-4b7e24dd58d3", "type": "simple", "updated_at": "2024-01-26T09:55:18.250Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"_version": "WzQzODg0LDcwXQ==", "comments": [], "created_at": "2024-01-26T09:53:52.437Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "process.hash.sha256", "operator": "included", "type": "match", "value": "f7ac78ac57e8824fe66c6eea4dcdd0755e77b2a714e4e39bc381d6bccadf07fe"}], "id": "cfb6a650-bc30-11ee-9eba-5b4cdffa10fc", "item_id": "e4c867d5-0add-4997-9e4d-be7bbeb8175a", "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "name": "legit updater", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "2a887c3d-1afa-4c12-aa82-d26f67902c7c", "type": "simple", "updated_at": "2024-01-26T09:53:52.437Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"_version": "WzQzODgzLDcwXQ==", "comments": [], "created_at": "2024-01-26T09:50:54.676Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "process.hash.sha256", "operator": "included", "type": "match", "value": "0ff8fde495e86e08fa42343201dd38171962f13e9a8f87674df6550ec2cffcff"}], "id": "65c27940-bc30-11ee-9eba-5b4cdffa10fc", "item_id": "48f13bfc-c321-47d9-b89b-934ff29a5b1a", "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "name": "pdfcreator - legit", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "57268925-cc0d-4e99-896b-dc58438f0a1c", "type": "simple", "updated_at": "2024-01-26T09:50:54.676Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"_version": "WzQzODgyLDcwXQ==", "comments": [], "created_at": "2024-01-26T09:48:35.872Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "process.name", "operator": "included", "type": "match", "value": "OneXAgentUI.exe"}], "id": "1306aa00-bc30-11ee-9eba-5b4cdffa10fc", "item_id": "2236153a-a68c-42c8-b590-a0e0ddca6be4", "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "name": "Avaya software - doslownie kazdy proces/subproces ma podejrzany imphash", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "b3f95426-9372-443f-9dcb-e79fcf7c7a5f", "type": "simple", "updated_at": "2024-01-26T09:48:35.872Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"_version": "WzQzODgxLDcwXQ==", "comments": [], "created_at": "2024-01-26T09:33:52.524Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "process.hash.sha256", "operator": "included", "type": "match_any", "value": ["22a074396c761118d1bf87464906da5db8fc58206664c759de083027f71968c8", "cf89261528b3b7c89f2312834e412dfa9053559a4d7cef7fd17b77511c0e00e9", "3ecadf6443c2f1b9672315757ce9b0adc2f43acef7c3f1c0759c0781c4df17af"]}], "id": "048274c0-bc2e-11ee-9eba-5b4cdffa10fc", "item_id": "ca3cb518-ec97-43df-aad1-c4caaa842428", "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "name": "alpha related", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "e98346be-0c40-4ffe-85ac-8b4a4a84142e", "type": "simple", "updated_at": "2024-01-26T09:33:52.524Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"_version": "WzQzODgwLDcwXQ==", "comments": [{"comment": "nie wiem, duza czesc oprogramowania alfy ma takie same imphashe co malware xD", "created_at": "2024-01-26T09:30:00.157Z", "created_by": "elastic", "id": "866ba4c5-92c9-4e24-bccc-76d9a7a7ac34"}], "created_at": "2024-01-26T09:30:00.157Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "process.hash.sha256", "operator": "included", "type": "match", "value": "22a074396c761118d1bf87464906da5db8fc58206664c759de083027f71968c8"}], "id": "7a0210d0-bc2d-11ee-9eba-5b4cdffa10fc", "item_id": "215db6d3-70a6-4593-9292-52408e8aac48", "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "name": "alfa app", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "e660b8e2-0bd0-4817-90f9-c94369fcab88", "type": "simple", "updated_at": "2024-01-26T09:30:00.157Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"_version": "WzQzODc5LDcwXQ==", "comments": [{"comment": "legit", "created_at": "2024-01-26T09:26:17.190Z", "created_by": "elastic", "id": "f0a34fda-7c9e-4bfc-ac3e-78ce74c6acd2"}], "created_at": "2024-01-26T09:26:17.190Z", "created_by": "elastic", "description": "Exception list item", "entries": [{"field": "process.hash.sha256", "operator": "included", "type": "match", "value": "3ecadf6443c2f1b9672315757ce9b0adc2f43acef7c3f1c0759c0781c4df17af"}], "id": "f51c0060-bc2c-11ee-9eba-5b4cdffa10fc", "item_id": "34266a4e-846c-42f6-b368-3c350e1b65f9", "list_id": "0d39730f-2345-43e1-bc1b-c6a90d7fafd4", "name": "CefSharp.BrowserSubprocess.exe", "namespace_type": "single", "os_types": [], "tags": [], "tie_breaker_id": "98f4b796-0393-4f39-8e78-346549e66318", "type": "simple", "updated_at": "2024-01-26T09:26:17.190Z", "updated_by": "elastic", "author": ["Szymon Gluch"]}{"exported_count": 15, "exported_rules_count": 1, "missing_rules": [], "missing_rules_count": 0, "exported_exception_list_count": 1, "exported_exception_list_item_count": 13, "missing_exception_list_item_count": 0, "missing_exception_list_items": [], "missing_exception_lists": [], "missing_exception_lists_count": 0, "exported_action_connector_count": 0, "missing_action_connection_count": 0, "missing_action_connections": [], "excluded_action_connection_count": 0, "excluded_action_connections": [], "author": ["Szymon Gluch"]}