{"id": "bbd53f20-b6b3-11ee-a3e5-fd5e9cb555ae", "updated_at": "2024-01-19T10:16:23.978Z", "updated_by": "elastic", "created_at": "2024-01-19T10:16:08.287Z", "created_by": "elastic", "name": "NETXP EQL Loading images from remote shares", "tags": [], "interval": "5m", "enabled": false, "description": "security feature prevents and logs the loading of images from remote UNC/WebDAV shares. This is a crucial defense against a common exploitation technique known as DLL hijacking, often employed to load attacker code from a controlled location. This technique is exemplified by the MS10-046 shortcut icon DLL loader exploit. By blocking the loading of images from external, potentially malicious sources, this security measure helps safeguard against vulnerabilities and malicious code execution.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://10.0.8.140:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "1ebc3e49-8011-4a24-bec3-3caf87252060", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": ["https://www.rapid7.com/db/modules/exploit/windows/browser/ms10_046_shortcut_icon_dllloader"], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where event.code == \"7\" or event.code == \"9\" and winlog.channel: \"Microsoft-Windows-Security-Mitigations\"  \n// oczekuje dodanego kanalu Mitigations", "filters": [], "throttle": "no_actions", "actions": []}
