{"id": "b93179e0-b6b4-11ee-a3e5-fd5e9cb555ae", "updated_at": "2024-01-19T10:23:05.652Z", "updated_by": "elastic", "created_at": "2024-01-19T10:23:01.253Z", "created_by": "elastic", "name": "NETXP EQL Export/Import Address Table Access Filtering detected", "tags": [], "interval": "5m", "enabled": false, "description": "The Export Address Table (EAT) and Import Address Table (IAT) are critical components in the execution of programs. Access Filtering controls interactions with these tables, preventing unauthorized access and potential exploits. This adds a layer of protection against attacks aiming to manipulate or exploit these tables for malicious purposes. The security measure ensures that only legitimate and authorized operations are allowed on EAT/IAT, enhancing the overall security posture of the system.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://10.0.8.140:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "9ff3ea5c-b6d9-4209-9511-fbdd4cd4468d", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where event.code == \"13\" or event.code == \"14\" or event.code == \"15\" or event.code == \"15\" and winlog.channel: \"Microsoft-Windows-Security-Mitigations\"  \n// oczekuje dodanego kanalu Mitigations", "filters": [], "throttle": "no_actions", "actions": []}
