{"id": "dd1562f0-bab4-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-29T12:57:53.857Z", "updated_by": "elastic", "created_at": "2024-01-24T12:34:06.117Z", "created_by": "elastic", "name": "NETXP LINUX Kernel parameters (sysctl) modification", "tags": [], "interval": "5m", "enabled": false, "revision": 1, "description": " Rules is designed to monitor changes to kernel parameters by tracking modifications to the sysctl.conf file and files in the sysctl.d directory. The generated audit events help in identifying any unauthorized modifications to kernel parameters.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "468f3546-a23d-4eaa-b137-41f0b68aa515", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"*sysctl*\" and\nany where event.module: \"auditd\"", "filters": [], "actions": []}