{"id": "cd84dcd0-bb6d-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-25T10:37:56.897Z", "updated_by": "elastic", "created_at": "2024-01-25T10:37:56.897Z", "created_by": "elastic", "name": "NETXP LINUX Virtualization - Virt-Manager usage", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors the execution of Virt-Manager (virt-manager), providing visibility into virtualization-related activities on the system. Detection of Virt-Manager activities helps in monitoring virtualization operations and potential security risks.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "01def01e-1f56-4b70-960b-d19120c5c80f", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"virt-manager\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}