{"id": "7c59cc80-bab9-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T13:07:11.308Z", "updated_by": "elastic", "created_at": "2024-01-24T13:07:11.308Z", "created_by": "elastic", "name": "NETXP LINUX Stunnel binary usage - potential unauthorized network connection", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Rule is designed to provide visibility into the execution of the Stunnel binary on the system. Stunnel is a program that allows you to create secure tunnels for network traffic, typically used for securing communication channels.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "85e4c9ce-8a96-4348-bdcb-07b15790eacb", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "\n//any where auditd.log.key: \"*stunnel*\" and\nany where event.module: \"auditd\"\n\n\n", "filters": [], "actions": []}