{"id": "7ae94ec0-bac8-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T14:54:31.344Z", "updated_by": "elastic", "created_at": "2024-01-24T14:54:31.344Z", "created_by": "elastic", "name": "NETXP LINUX Process ID Change (Switching Accounts)", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors executions of /bin/su and /usr/bin/sudo, which are utilities for switching user accounts. Changes in these utilities could indicate privilege escalation attempts.", "risk_score": 47, "severity": "medium", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "d1b8151c-b684-4b34-8d2e-42268c3aff84", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"priv_esc\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}