{"id": "c0bfb260-bacb-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T15:17:57.007Z", "updated_by": "elastic", "created_at": "2024-01-24T15:17:57.007Z", "created_by": "elastic", "name": "NETXP LINUX Suspicious Shell Commands executed", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors executions of suspicious shell commands that may be indicative of malicious activities. This rule covers a variety of shell commands, including ash, csh, fish, tcsh, tclsh, xonsh, and others. Detection of these commands helps in identifying potential malicious activity or unauthorized access attempts.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "d61983a3-1d5e-47c7-84c8-25cc7c3ebd04", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"susp_shell\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}