{"id": "6a246950-bb6b-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-25T10:20:51.178Z", "updated_by": "elastic", "created_at": "2024-01-25T10:20:51.178Z", "created_by": "elastic", "name": "NETXP LINUX Third party software manager used", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors software management activities on Linux systems, covering commands related to 3rd party software managers like NPM, Lua, Pacman. This rule enhances visibility into changes to the system's software configuration on Linux. Detection of third party-related commands helps in identifying potential security risks associated with software installations.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "4103dda4-fb2f-480d-ae72-e0a46be13205", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"third_party_software_mgmt\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}