{"id": "94338f00-8ad8-11ee-a3e5-fd5e9cb555ae", "updated_at": "2023-11-24T14:48:51.942Z", "updated_by": "elastic", "created_at": "2023-11-24T14:48:49.908Z", "created_by": "elastic", "name": "NETXP New hardware addition on critical Linux machine", "tags": ["OS: Linux"], "interval": "10m", "enabled": false, "description": "Alerts tracks kernel logs for any new ANCP (Advanced Configuration and Power Interface) bus type logs. Any connected device will require this to function properly.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://10.0.8.140:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-660s", "rule_id": "fd62cdd0-f1a8-43fe-bd36-fe9b130a7abd", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "query", "language": "kuery", "index": ["logs-*"], "query": "(message: \"ACPI: bus type\" AND NOT host.os.family: \"windows\" AND NOT agent.name: \"kibana1-prod\")", "filters": [], "throttle": "no_actions", "actions": []}
