{"id": "a3a1f280-bac4-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T14:27:01.678Z", "updated_by": "elastic", "created_at": "2024-01-24T14:27:01.678Z", "created_by": "elastic", "name": "NETXP LINUX Login Configuration modification", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Rule is to provide visibility into changes made to key files related to login configuration and information. Monitoring these files is important for maintaining the security and integrity of the login configuration and user authentication mechanisms on the system.\n\nChanges to files such as /etc/login.defs may involve alterations to system-wide login configurations. Monitoring these changes helps in ensuring that security-related settings are not modified without proper authorization.\nThe /etc/securetty file contains a list of terminals considered secure for root logins. Monitoring changes to this file is important for security, as it controls where root can log in.\nFiles like /var/log/faillog and /var/log/tallylog are used to track failed login attempts. Monitoring these files can help in identifying potential security threats or unauthorized access attempts.\nThe /var/log/lastlog file keeps a record of the last login time for each user. Changes to this file may indicate modifications to user login information.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "43fe46b3-728b-4fa8-99b8-56942cfcf6e3", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "\n//any where auditd.log.key: \"*login*\" and\nany where event.module: \"auditd\"\n", "filters": [], "actions": []}