{"id": "8d6c4ff0-baca-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T15:09:21.414Z", "updated_by": "elastic", "created_at": "2024-01-24T15:09:21.414Z", "created_by": "elastic", "name": "NETXP LINUX Additional Netcat Detection on Ubuntu", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors additional rules for detecting netcat on Ubuntu. This rule helps in detecting the presence or use of netcat, a versatile networking tool that can be misused for various malicious activities, including unauthorized access and data exfiltration.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "ff93365a-577d-44a4-b5d8-d5660042424e", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"susp_activity\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}