{"id": "fbf1b620-b923-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-22T12:44:29.704Z", "updated_by": "elastic", "created_at": "2024-01-22T12:44:29.704Z", "created_by": "elastic", "name": "NETXP EQL Suspicious Buffer overflow attempt on linux machine", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Rule defines a sequence detection pattern for monitoring system logs, it looks for any Kernel function call to execute a program followed by ANY program segmentation fault exception (Segmentation faults occur when a program attempts to access memory that it does not have permission to access or when it tries to access memory that does not exist. Segmentation faults can be caused by a variety of reasons, including uninitialized pointers, out-of-bounds memory access, and memory leaks) - It is a vector of performing buffer overflows within Linux kernel.\n\n//dodatkowe audytowanie maszyn linuxa - Linux Audit Framework", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "6cffcc2e-b89d-4f33-bda1-4f8fc4ffb2a5", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-system.syslog-default*"], "query": "sequence by host.hostname with maxspan=5s\n  [ any where message : \"*execve*\" and (message: \".py\" or message: \".sh\" or message: \".c\" or message: \".cpp\")]\n  [ any where message: \"*segfault*\"]\n", "filters": [], "actions": []}{"exported_count": 1, "exported_rules_count": 1, "missing_rules": [], "missing_rules_count": 0, "exported_exception_list_count": 0, "exported_exception_list_item_count": 0, "missing_exception_list_item_count": 0, "missing_exception_list_items": [], "missing_exception_lists": [], "missing_exception_lists_count": 0, "exported_action_connector_count": 0, "missing_action_connection_count": 0, "missing_action_connections": [], "excluded_action_connection_count": 0, "excluded_action_connections": [], "author": ["Szymon Gluch"]}