{"id": "14771410-b6b8-11ee-a3e5-fd5e9cb555ae", "updated_at": "2024-01-19T10:47:32.291Z", "updated_by": "elastic", "created_at": "2024-01-19T10:47:02.868Z", "created_by": "elastic", "name": "NETXP EQL Return-Oriented Programming (ROP) Event detected", "tags": [], "interval": "5m", "enabled": false, "description": "Return-Oriented Programming (ROP) attack, an attacker leverages existing code fragments, called gadgets, within a target application to construct a sequence of operations without injecting new code. This technique is often employed when facing security measures like Data Execution Prevention (DEP) and Address Space Layout Randomization (ASLR). The attacker identifies and chains together gadgets, exploiting a vulnerability to manipulate the program's control flow. As the ROP chain executes, each gadget performs a specific task, collectively achieving the attacker's objectives. Unlike traditional code injection, ROP attacks use legitimate code fragments in unintended ways, making them challenging to detect. Defense mechanisms like control flow integrity (CFI) aim to mitigate ROP attacks by monitoring and restricting the legitimate control flow within a program", "risk_score": 99, "severity": "critical", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://10.0.8.140:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "ec4c70b4-2d11-4c8c-904e-bb59c99f7ca4", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 2, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["apm-*-transaction*", "auditbeat-*", "endgame-*", "filebeat-*", "logs-*", "packetbeat-*", "traces-apm*", "winlogbeat-*", "-*elastic-cloud-logs-*"], "query": "any where event.code == \"19\" or event.code == \"21\" or event.code == \"23\" or event.code == \"15\" and winlog.channel: \"Microsoft-Windows-Security-Mitigations\"  \n// oczekuje dodanego kanalu Mitigations", "filters": [], "throttle": "no_actions", "actions": []}
