{"id": "e164e1c0-bac6-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T14:43:04.288Z", "updated_by": "elastic", "created_at": "2024-01-24T14:43:04.288Z", "created_by": "elastic", "name": "NETXP LINUX PAM Configuration: change", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors changes to PAM (Pluggable Authentication Modules) configuration files in /etc/pam.d/ and related files (/etc/security/limits.conf, /etc/security/limits.d, /etc/security/pam_env.conf, /etc/security/namespace.conf, /etc/security/namespace.d, /etc/security/namespace.init). PAM controls authentication for various applications and services.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "af9a7d76-62ba-4110-b86b-17f7ca2ca4d7", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"pam\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}