{"id": "2c3732d0-bac6-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T14:38:13.305Z", "updated_by": "elastic", "created_at": "2024-01-24T14:38:00.320Z", "created_by": "elastic", "name": "NETXP LINUX Unauthorized Changes to /etc/issue and /etc/issue.net", "tags": [], "interval": "5m", "enabled": false, "revision": 1, "description": "/etc/issue and /etc/issue.net are files that are commonly used to display system information or a custom message to users when they log in or connect to a system.\n\nThe /etc/issue file typically contains information that is displayed on the system's console before a user logs in, providing details about the operating system or other relevant information. The /etc/issue.net file, on the other hand, is used in network logins and may display a message when users connect to services like SSH.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "4fb5384a-884a-4f50-973f-8f0061411aec", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"etcissue\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}