{"id": "93a9c670-bab8-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T13:04:17.964Z", "updated_by": "elastic", "created_at": "2024-01-24T13:00:40.922Z", "created_by": "elastic", "name": "NETXP LINUX Suspicious System time change through syscall", "tags": [], "interval": "5m", "enabled": false, "revision": 2, "description": "Rule monitors time-related adjustments, excluding events associated with the NTP service. The audit events help track changes to the system time. ", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "6800bf77-67bc-4f5b-ab1b-606a9a2a8b33", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"*time*\" and\nany where event.module: \"auditd\"\n\n", "filters": [], "actions": []}