{"id": "06837200-bac7-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-29T12:55:59.381Z", "updated_by": "elastic", "created_at": "2024-01-24T14:44:06.566Z", "created_by": "elastic", "name": "NETXP LINUX Mail Configuration modification", "tags": [], "interval": "5m", "enabled": false, "revision": 1, "description": "Monitors changes to mail configuration files, including /etc/aliases, /etc/postfix/, and /etc/exim4/. These files are used for configuring mail aliases and mail server settings.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "e6ae8e2d-319c-4656-8ebe-fb3e1a58d58e", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"mail\" and\n any where event.module: \"auditd\"\n", "filters": [], "actions": []}