{"id": "6b45bb00-bb6f-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-25T10:49:31.060Z", "updated_by": "elastic", "created_at": "2024-01-25T10:49:31.060Z", "created_by": "elastic", "name": "NETXP LINUX High Volume Events - File Events (unauthorized Access - Unsuccessful)", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors unsuccessful file access attempts, including creat, open, openat, open_by_handle_at, truncate, ftruncate, resulting in EACCES or EPERM errors. Detection of unauthorized access helps in monitoring potential security breaches.\n\nMonitors unsuccessful file creation attempts, including mkdir, creat, link, symlink, mknod, mknodat, linkat, symlinkat, resulting in EACCES or EPERM errors. Detection of unsuccessful file creation helps in monitoring potential security breaches.\n\nMonitors unsuccessful file modification attempts, including rename, renameat, truncate, chmod, setxattr, lsetxattr, removexattr, lremovexattr, resulting in EACCES or EPERM errors. Detection of unsuccessful file modification helps in monitoring potential security breaches.\n", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "a35b8bfe-c909-4afd-a6df-0c94c7f25df3", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//auditd.log.key: \"file_access\" or auditd.log.key: \"file_creation\" or auditd.log.key: \"file_modification\" and\nany where event.module: \"auditd\"\n", "filters": [], "actions": []}