{"id": "ecf666d0-bb6b-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-25T10:24:30.659Z", "updated_by": "elastic", "created_at": "2024-01-25T10:24:30.659Z", "created_by": "elastic", "name": "NETXP LINUX Special Software - CHEF used ", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors accesses and modifications to the Chef configuration directory located in /etc/chef. Detection of activities in this directory helps in maintaining the security of Chef configurations.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "eac2ff62-5ca1-4ada-bba0-d2a46461db06", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"soft_chef\" and\n any where event.module: \"auditd\"\n", "filters": [], "actions": []}