{"id": "16b65160-bab8-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T12:57:11.290Z", "updated_by": "elastic", "created_at": "2024-01-24T12:57:11.290Z", "created_by": "elastic", "name": "NETXP LINUX Attributable user using Swap change", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Rule monitors changes to swap configuration by tracking the swapon and swapoff syscalls, generating audit events for attributable users.\nThe swapon and swapoff syscalls in Linux are used to manage swap space, which is an area on a storage device (usually a disk) that is used as virtual memory extension when the physical RAM is full. These syscalls are critical for the dynamic management of swap space and play a key role in the overall performance and stability of the system.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "8f776f1d-3762-43a9-9095-8b1337bb8fcf", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"*swap*\" and\nany where event.module: \"auditd\"", "filters": [], "actions": []}