{"id": "d6310ab0-b9ed-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-26T08:33:29.513Z", "updated_by": "elastic", "created_at": "2024-01-23T12:49:24.704Z", "created_by": "elastic", "name": "NETXP TI Detected malicious file hash", "tags": [], "interval": "1h", "enabled": true, "revision": 1, "description": "Rule is designed to monitor and identify potentially harmful or malicious activity by comparing cryptographic hash values associated with files, processes, or data against a curated list of known malicious hash signatures. This proactive security measure allows to swiftly detect the presence of malicious files. By leveraging threat intelligence databases, the rule enhances the ability to recognize and respond to cyber threats promptly, contributing to a robust defense against various forms of malware, exploits, or other security risks within a computing environment.", "risk_score": 99, "severity": "critical", "license": "", "output_index": "", "meta": {"from": "5m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-3900s", "rule_id": "0c5b95ce-53b4-42eb-87a6-cf65406feae7", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "threat_match", "language": "kuery", "index": ["logs-*"], "query": "file.hash.md5 : * OR file.hash.sha1 : * OR file.hash.sha256: * OR file.hash.sha512: *", "filters": [], "threat_filters": [], "threat_query": "@timestamp >= \"now-30d/d\"", "threat_mapping": [{"entries": [{"field": "file.hash.md5", "type": "mapping", "value": "threat.indicator.file.hash.md5"}]}, {"entries": [{"field": "file.hash.sha1", "type": "mapping", "value": "threat.indicator.file.hash.sha1"}]}, {"entries": [{"field": "file.hash.sha256", "type": "mapping", "value": "threat.indicator.file.hash.sha256"}]}], "threat_language": "kuery", "threat_index": ["logs-ti*"], "threat_indicator_path": "threat.indicator", "actions": []}{"exported_count": 1, "exported_rules_count": 1, "missing_rules": [], "missing_rules_count": 0, "exported_exception_list_count": 0, "exported_exception_list_item_count": 0, "missing_exception_list_item_count": 0, "missing_exception_list_items": [], "missing_exception_lists": [], "missing_exception_lists_count": 0, "exported_action_connector_count": 0, "missing_action_connection_count": 0, "missing_action_connections": [], "excluded_action_connection_count": 0, "excluded_action_connections": [], "author": ["Szymon Gluch"]}