{"id": "2c8d5e90-bac5-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T14:30:51.390Z", "updated_by": "elastic", "created_at": "2024-01-24T14:30:51.390Z", "created_by": "elastic", "name": "NETXP LINUX Suspicious network environment modification", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Rule monitors changes to network environment and configuration like:\nChanges to Hostname:\n\nRule watches for changes to the hostname and domain name.\nKey: network_modifications\nDetect Remote Shell Use:\n\nMonitors successful connections made by /bin/bash and /usr/bin/bash.\nKey: remote_shell\nSuccessful IPv4 Connections:\n\nMonitors successful IPv4 connections.\nKey: network_connect_4\nSuccessful IPv6 Connections:\n\nMonitors successful IPv6 connections.\nKey: network_connect_6\nChanges to Other Files:\n\nMonitors write and attribute changes to various network-related files.\nFiles include /etc/hosts, /etc/sysconfig/network, /etc/sysconfig/network-scripts, /etc/network/, and /etc/NetworkManager/.\nKey: network_modifications for most files, except /etc/NetworkManager/ which has a distinct key.\nChanges to Issue Files:\n\nMonitors write and attribute changes to /etc/issue and /etc/issue.net.\nKeys: etcissue and etcissue.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "e6430aa0-d037-4284-b24a-97021dd0629b", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "\n\n//any where auditd.log.key: \"*network_modifications*\" and\nany where event.module: \"auditd\"", "filters": [], "actions": []}