{"id": "b49e3d50-bb6e-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-25T10:44:24.618Z", "updated_by": "elastic", "created_at": "2024-01-25T10:44:24.618Z", "created_by": "elastic", "name": "NETXP LINUX High Volume Events - Common Shells used", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors common shells, including bash, dash, busybox, zsh, sh, ksh. Detection of common shell executions helps in monitoring shell-based activities and identifying potential security risks.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "1ce117fd-a122-47fe-933e-0b3e59ff8b56", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"susp_shell\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}