{"id": "a7d406a0-bac8-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T14:55:46.704Z", "updated_by": "elastic", "created_at": "2024-01-24T14:55:46.704Z", "created_by": "elastic", "name": "NETXP LINUX Power State binaries used", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors executions of power-related commands (/sbin/shutdown, /sbin/poweroff, /sbin/reboot, /sbin/halt). Changes to these commands could indicate attempts to manipulate the system's power state.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "c42ff071-1141-4296-93d2-229f2bcc71e9", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"power\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}