{"id": "a71f3bb0-bb6f-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-25T10:51:11.472Z", "updated_by": "elastic", "created_at": "2024-01-25T10:51:11.472Z", "created_by": "elastic", "name": "NETXP LINUX High Volume Events - File Deletion Events by User", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors file deletion events, including rmdir, unlink, unlinkat, rename, renameat, performed by users with UID greater than or equal to 1000. Detection of file deletion events helps in monitoring potential unauthorized file deletion activities.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "53b8093e-bb91-4ee6-a664-8406dd03ff3d", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"delete\" and\n any where event.module: \"auditd\"\n", "filters": [], "actions": []}