{"id": "48e19ed0-baca-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T15:07:44.228Z", "updated_by": "elastic", "created_at": "2024-01-24T15:07:26.413Z", "created_by": "elastic", "name": "NETXP LINUX sssd Child Process Execution (T1078_Valid_Accounts)", "tags": [], "interval": "5m", "enabled": false, "revision": 1, "description": "Monitors the execution of sssd related child processes, which are part of the System Security Services Daemon (sssd). This rule helps in identifying valid user accounts and access attempts within the context of sssd processes, contributing to the detection of potential account misuse or abuse.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "91fed7bc-24c9-4850-865a-3326db10779c", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"T1078_Valid_Accounts\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}