{"id": "93da35d0-bf59-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-30T10:23:15.787Z", "updated_by": "elastic", "created_at": "2024-01-30T10:23:15.787Z", "created_by": "elastic", "name": "NETXP EQL Account locked (from admin group) ", "tags": [], "interval": "5m", "enabled": true, "revision": 0, "description": "This rule monitors the Security event logs for occurrences of account lockouts originating from accounts belonging to privileged groups, specifically the administrator group(s), within the Windows environment. Account lockouts from privileged groups may indicate potential security threats or misconfigurations that require immediate investigation and remediation.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "70c40b38-da97-42b9-bf83-93e5caec161a", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-system.security-default*"], "query": "any where (winlog.event_data.TargetSid in (\"S-1-5-32-544\") or winlog.event_data.TargetSid: \"S-1-5-21*\") and winlog.event_id == 4740", "filters": [], "actions": []}