{"id": "67d34fa0-bab6-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T12:45:08.383Z", "updated_by": "elastic", "created_at": "2024-01-24T12:45:08.383Z", "created_by": "elastic", "name": "NETXP LINUX KExec Usage - attempt to load new kernel", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Rule monitors the usage of the kexec_load syscall, which is associated with the KExec mechanism for loading a new kernel from the currently running kernel. This helps in tracking any actions related to kernel execution.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "a2986cd3-55d9-4147-af72-077b16ed1033", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"*KEXEC*\" and\nany where event.module: \"auditd\"", "filters": [], "actions": []}