{"id": "ab2bc7f0-8474-11ee-9f2d-bd3097ef4d0a", "updated_at": "2024-01-08T08:54:10.493Z", "updated_by": "elastic", "created_at": "2023-11-16T11:38:31.800Z", "created_by": "Szymon Gluch", "name": "NETXP PowerShell Script Detected Calling a Credential Prompt", "tags": ["OS: Windows"], "interval": "10m", "enabled": false, "revision": 1, "description": "Adversaries might want to trick users to enter their credentials to allegedly confirm some action. If such scrip runs not properly trained employee might help attackers escalate and gain additional privileges with gained credentials. If any PowerShell script runs in the environment rule looks for Get-Credential", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "10m", "kibana_siem_app_url": "https://10.7.1.125:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-1200s", "rule_id": "9b820a21-cd58-460d-8bcc-8837f21c83b3", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "query", "language": "kuery", "index": ["logs-*"], "query": "\nwinlog.provider_name: \"Microsoft-Windows-PowerShell\" AND event.dataset: \"windows.powershell_operational\" AND (powershell.file.script_block_text: \"*Get-Credential*\" OR powershell.file.script_block_text: \"Get - Credential\")\n", "filters": [], "actions": []}{"exported_count": 1, "exported_rules_count": 1, "missing_rules": [], "missing_rules_count": 0, "exported_exception_list_count": 0, "exported_exception_list_item_count": 0, "missing_exception_list_item_count": 0, "missing_exception_list_items": [], "missing_exception_lists": [], "missing_exception_lists_count": 0, "exported_action_connector_count": 0, "missing_action_connection_count": 0, "missing_action_connections": [], "excluded_action_connection_count": 0, "excluded_action_connections": [], "author": ["Szymon Gluch"]}