{"id": "cdbc4800-bc53-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-26T14:04:21.508Z", "updated_by": "elastic", "created_at": "2024-01-26T14:04:21.508Z", "created_by": "elastic", "name": "NETXP EQL User logged on multiple stations simultaneously", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "This rule detects instances where a user account is logged on to multiple stations simultaneously within a short timeframe. Such activity may indicate potential unauthorized access or misuse of user credentials and should be investigated promptly.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "737a91fa-3c35-4b9c-9760-598ec1570e1f", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "threshold", "language": "lucene", "index": ["logs-system.security-default*"], "query": "(event.code : \"4624\" AND event.provider: \"Microsoft-Windows-Security-Auditing\") AND NOT user.name: \"SYSTEM\"", "filters": [], "threshold": {"field": ["user.name"], "value": 10, "cardinality": [{"field": "host.name", "value": 10}]}, "actions": []}