{"id": "a69615e0-bb6c-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-25T10:29:42.083Z", "updated_by": "elastic", "created_at": "2024-01-25T10:29:42.083Z", "created_by": "elastic", "name": "NETXP LINUX T1081 String Search Commands used", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors string search commands, including grep, egrep, ugrep, bgrep, rg, cgrep, ngrep, vgrep, pt, ucg, ag, ack, and semgrep. Detection of these commands helps in identifying potential instances of sensitive information or credentials stored in files.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "2b93a698-2a3a-4c33-b20c-f998df5d9b29", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"string_search\" and \nany where event.module: \"auditd\"\n\n\n\n\n", "filters": [], "actions": []}