{"id": "4cf2dae0-bb86-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-26T10:13:17.996Z", "updated_by": "elastic", "created_at": "2024-01-25T13:33:19.272Z", "created_by": "elastic", "name": "NEXTXP Connection to 50 or more countries - kalibracja", "tags": [], "interval": "5m", "enabled": true, "revision": 1, "description": "This rule is designed to monitor and detect outbound network connections initiated by host to 50 or more countries. Unusual or excessive connections to a large number of countries may indicate suspicious or malicious activity, warranting further investigation.", "risk_score": 47, "severity": "medium", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "d48283e8-6d47-4d1c-bb89-c15b71ce339b", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "threshold", "language": "kuery", "index": ["logs-*"], "query": "destination.geo.country_name: *", "filters": [], "threshold": {"field": ["source.ip"], "value": 50, "cardinality": [{"field": "destination.geo.country_name", "value": 50}]}, "actions": []}{"exported_count": 1, "exported_rules_count": 1, "missing_rules": [], "missing_rules_count": 0, "exported_exception_list_count": 0, "exported_exception_list_item_count": 0, "missing_exception_list_item_count": 0, "missing_exception_list_items": [], "missing_exception_lists": [], "missing_exception_lists_count": 0, "exported_action_connector_count": 0, "missing_action_connection_count": 0, "missing_action_connections": [], "excluded_action_connection_count": 0, "excluded_action_connections": [], "author": ["Szymon Gluch"]}