{"id": "1fd3e080-bb6e-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-25T10:40:14.988Z", "updated_by": "elastic", "created_at": "2024-01-25T10:40:14.988Z", "created_by": "elastic", "name": "NETXP LINUX Virtualization (VirtualBox) on macOS - Additional Tools used ", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors the execution of additional VirtualBox tools on macOS, including VirtualBoxVM, VBoxManage, VBoxVRDP, VBoxHeadless, vboxwebsrv, VBoxBugReport, VBoxBalloonCtrl, VBoxAutostart, VBoxDTrace, vbox-img, org.virtualbox.startup.plist, /Library/Application Support/VirtualBox/LaunchDaemons/, /Library/Application Support/VirtualBox/VBoxDrv.kext/, /Library/Application Support/VirtualBox/VBoxUSB.kext/, /Library/Application Support/VirtualBox/VBoxNetFlt.kext/, /Library/Application Support/VirtualBox/VBoxNetAdp.kext/. Detection of these tools helps in monitoring VirtualBox-related activities on macOS.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "607347d6-6942-4f73-8211-38f7f5db917d", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"virt_tool\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}