{"id": "1d77e490-bb6d-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-25T10:33:01.533Z", "updated_by": "elastic", "created_at": "2024-01-25T10:33:01.533Z", "created_by": "elastic", "name": "NETXP LINUX Docker usage detected", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors the execution of the Docker, providing visibility into Docker-related activities on the system. Detection of Docker daemon activities helps in monitoring container-related operations and potential security risks associated with Docker.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "a550393c-d88c-4e14-9c9b-34f2ccd8296f", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"docker\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}