{"id": "90cfb450-bacc-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T15:23:46.075Z", "updated_by": "elastic", "created_at": "2024-01-24T15:23:46.075Z", "created_by": "elastic", "name": "NETXP LINUX Data Injection Detected", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors code injection through the ptrace facility, providing visibility into potential security threats. This rule includes events indicating data injection. Detection of such activities is crucial for identifying attempts to manipulate or compromise running processes using the ptrace system call.", "risk_score": 99, "severity": "critical", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "88b89cc3-449f-4748-9fc2-2e36007c7160", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"data_injection\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}