{"id":"a8c13d10-8794-11ee-9f2d-bd3097ef4d0a","updated_at":"2024-01-08T08:54:10.385Z","updated_by":"elastic","created_at":"2023-11-20T11:05:07.859Z","created_by":"Eliza Samsel","name":"NETXP Audit Log Was Cleared","tags":[],"interval":"10m","enabled":false,"revision":5,"description":"Identifies attempts to clear Windows event log stores. This is often done by attackers in an attempt to evade detection or destroy forensic evidence on a system.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://10.7.1.125:5601/app/security"},"author":["Eliza Samsel"],"false_positives":[],"from":"now-660s","rule_id":"a31eb083-6a56-4e2d-988f-cd2a39d5374e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1070","name":"Indicator Removal","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1070/001","name":"Clear Windows Event Logs","id":"T1070.001"}],"id":"T1070"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0005","name":"Defense Evasion","id":"TA0005"}}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.action:\"audit-log-cleared\" OR event.action:\"Log clear\" AND winlog.api:\"wineventlog\"","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
