{"id": "46e949e0-bacd-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T15:28:51.588Z", "updated_by": "elastic", "created_at": "2024-01-24T15:28:51.588Z", "created_by": "elastic", "name": "NETXP LINUX Privilege Abuse Detection", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Detects potential privilege abuse by the root user in user's home directories. This rule focuses on monitoring access and activities within user home directories by the root user. Detection of such activities is essential for identifying potential misuse of administrative privileges.", "risk_score": 99, "severity": "critical", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "77b6dfd1-9bd8-4330-b5b8-221c521705df", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"power_abuse\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}