{"id": "c7e59230-bb6b-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-25T10:23:28.471Z", "updated_by": "elastic", "created_at": "2024-01-25T10:23:28.471Z", "created_by": "elastic", "name": "NETXP LINUX Special Software - IBM Bigfix BESClient used", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors accesses and modifications to directories related to IBM Bigfix BESClient, located in /opt/BESClient and /var/opt/BESClient/. Detection of activities in these directories helps in maintaining the integrity and security of IBM Bigfix configurations.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "c21d1bff-ab47-4b9e-8084-0a41cfaff3f7", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"soft_besclient\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}