{"id":"627cd030-87a3-11ee-9f2d-bd3097ef4d0a","updated_at":"2024-01-08T08:54:10.736Z","updated_by":"elastic","created_at":"2023-11-20T12:50:29.693Z","created_by":"Eliza Samsel","name":"NETXP System shutdown / reboot outside hours","tags":[],"interval":"5m","enabled":false,"revision":4,"description":"Detecting system shutdown or reboot outside normal hours for critical agents.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"from":"1m","kibana_siem_app_url":"https://10.7.1.125:5601/app/security"},"author":["Eliza Samsel"],"false_positives":[],"from":"now-360s","rule_id":"1824afcc-9058-4061-847d-e0673b77cf25","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"security-solution-default","query":"(winlog.event_id : 1074 OR winlog.event_id : 6006 OR winlog.event_id : 6008) AND agent.name: *","filters":[{"$state":{"store":"appState"},"meta":{"negate":false,"index":"security-solution-default","alias":null,"disabled":false,"type":"combined","params":[{"meta":{"field":"hour_of_day","negate":false,"index":"security-solution-default","alias":null,"disabled":false,"params":{"lt":"5","gte":"0"},"type":"range","value":{"lt":"5","gte":"0"},"key":"hour_of_day"},"query":{"range":{"hour_of_day":{"lt":"5","gte":"0"}}}},{"meta":{"field":"hour_of_day","negate":false,"index":"security-solution-default","alias":null,"disabled":false,"params":{"lt":"23","gte":"18"},"type":"range","value":{"lt":"23","gte":"18"},"key":"hour_of_day"},"query":{"range":{"hour_of_day":{"lt":"23","gte":"18"}}}}],"relation":"OR"},"query":{}}],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
