{"id": "d62db360-bb6e-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-25T10:45:20.922Z", "updated_by": "elastic", "created_at": "2024-01-25T10:45:20.922Z", "created_by": "elastic", "name": "NETXP LINUX High Volume Events - Root Command Executions", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors command executions with root privileges (euid=0), excluding system-related activities. Detection of root command executions helps in monitoring potential privilege escalation attempts.", "risk_score": 21, "severity": "low", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "c9f2c400-41d1-4ff2-8031-99c2ce77aa60", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"rootcmd\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}