{"id": "58681b10-bb8b-11ee-9368-b791ac093412", "updated_at": "2024-01-30T10:32:54.042Z", "updated_by": "Szymon Gluch", "created_at": "2024-01-25T14:09:25.336Z", "created_by": "Szymon Gluch", "name": "NETXP New application installation outside of business hours", "tags": [], "interval": "5m", "enabled": true, "revision": 1, "description": "This rule is implemented to detect and respond to new application installations that occur outside of specified business hours. Unusual activity during non-business hours may indicate potentially unauthorized or malicious activities, and prompt investigation and action are required to ensure the security of the system.", "risk_score": 99, "severity": "critical", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://10.7.1.125:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "94dfd77e-3582-46e6-85ef-81a30478a4dd", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "query", "language": "kuery", "data_view_id": "security-solution-default", "query": "event.code: \"7045\" AND event.provider : \"Service Control Manager\"", "filters": [], "actions": []}{"exported_count": 1, "exported_rules_count": 1, "missing_rules": [], "missing_rules_count": 0, "exported_exception_list_count": 0, "exported_exception_list_item_count": 0, "missing_exception_list_item_count": 0, "missing_exception_list_items": [], "missing_exception_lists": [], "missing_exception_lists_count": 0, "exported_action_connector_count": 0, "missing_action_connection_count": 0, "missing_action_connections": [], "excluded_action_connection_count": 0, "excluded_action_connections": [], "author": ["Szymon Gluch"]}