{"id": "4f248900-bab7-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T12:51:36.470Z", "updated_by": "elastic", "created_at": "2024-01-24T12:51:36.470Z", "created_by": "elastic", "name": "NETXP LINUX NFS Mount Operations detected", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": " Rule focuses on monitoring NFS mount operations, specifically tracking the execution of mount.nfs commands by users with valid accounts.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "afecea2b-b594-4559-ac00-f1be8a5ef20d", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "\n//any where auditd.log.key: \"*T1078_Valid_Accounts*\" and\nany where event.module: \"auditd\"\n\n", "filters": [], "actions": []}