{"id": "7f7ab950-bb6e-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-25T10:42:55.465Z", "updated_by": "elastic", "created_at": "2024-01-25T10:42:55.465Z", "created_by": "elastic", "name": "NETXP LINUX Inter-Process Communication - IPC System Calls:", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Monitors Inter-Process Communication (IPC) system calls, including msgctl, msgget, semctl, semget, semop, semtimedop, shmctl, shmget. Detection of IPC system calls helps in monitoring communication between processes and identifying potential security risks.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "27597b9e-0904-4052-83d2-e7174c1c39cf", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"Inter-Process_Communication\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}