{"id":"df1eaeb0-99be-11ee-9f2d-bd3097ef4d0a","updated_at":"2024-01-08T08:54:09.208Z","updated_by":"elastic","created_at":"2023-12-13T13:52:40.755Z","created_by":"elastic","name":"NETXP Outbound TOR Traffic","tags":[],"interval":"1h","enabled":false,"revision":0,"description":"Outbound TOR Traffic","risk_score":99,"severity":"critical","license":"","output_index":"","meta":{"from":"10m","kibana_siem_app_url":"https://10.7.1.125:5601/app/security"},"author":[],"false_positives":[],"from":"now-4200s","rule_id":"0786f1a4-3c8a-48ba-bf1d-2818d36b0ba9","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"security-solution-default","query":"rule.name: ET TOR*","filters":[{"$state":{"store":"appState"},"meta":{"negate":false,"index":"security-solution-default","alias":null,"disabled":false,"type":"combined","params":[{"meta":{"field":"destination.ip","negate":true,"index":"security-solution-default","alias":null,"disabled":false,"params":{"lt":"10.255.255.255","gte":"10.0.0.0"},"type":"range","value":{"lt":"10.255.255.255","gte":"10.0.0.0"},"key":"destination.ip"},"query":{"range":{"destination.ip":{"lt":"10.255.255.255","gte":"10.0.0.0"}}}},{"meta":{"field":"destination.ip","negate":true,"index":"security-solution-default","alias":null,"disabled":false,"params":{"lt":"172.31.255.255","gte":"172.16.0.0"},"type":"range","value":{"lt":"172.31.255.255","gte":"172.16.0.0"},"key":"destination.ip"},"query":{"range":{"destination.ip":{"lt":"172.31.255.255","gte":"172.16.0.0"}}}},{"$state":{"store":"appState"},"meta":{"field":"destination.ip","negate":true,"alias":null,"index":"security-solution-default","disabled":false,"params":{"lt":"192.168.255.255","gte":"192.168.0.0"},"type":"range","value":{"lt":"192.168.255.255","gte":"192.168.0.0"},"key":"destination.ip"},"query":{"range":{"destination.ip":{"lt":"192.168.255.255","gte":"192.168.0.0"}}}}],"relation":"OR"},"query":{}}],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
