{"id": "1da17490-bac8-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T14:52:07.710Z", "updated_by": "elastic", "created_at": "2024-01-24T14:51:54.848Z", "created_by": "elastic", "name": "NETXP LINUX SELinux configuration files change", "tags": [], "interval": "5m", "enabled": false, "revision": 1, "description": "Monitors changes to SELinux configuration files in /etc/selinux/. SELinux is a mandatory access control (MAC) system that enhances security by enforcing access policies.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "c130bf40-47b7-4ae1-815f-4f9eafdc4194", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"mac_policy\" and \nany where event.module: \"auditd\"\n", "filters": [], "actions": []}