{"id": "5b0a36e0-babf-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-24T13:49:12.414Z", "updated_by": "elastic", "created_at": "2024-01-24T13:49:12.414Z", "created_by": "elastic", "name": "NETXP LINUX Sudoers File Changes", "tags": [], "interval": "5m", "enabled": false, "revision": 0, "description": "Rule monitors changes to the sudoers file and its associated directories, providing visibility into modifications that may impact sudo privileges on the system.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "75bb1a79-18a9-4d60-a07a-344a4ceba666", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "\n//any where auditd.log.key: \"*actions*\" and\nany where event.module: \"auditd\"\n", "filters": [], "actions": []}