{"id": "65aede70-bab5-11ee-9eba-5b4cdffa10fc", "updated_at": "2024-01-29T12:57:35.457Z", "updated_by": "elastic", "created_at": "2024-01-24T12:37:55.291Z", "created_by": "elastic", "name": "NETXP LINUX Generic Linux kernel module loading", "tags": [], "interval": "5m", "enabled": false, "revision": 1, "description": " Rule is designed to monitor and log activities related to the loading and unloading of kernel modules. This helps in identifying potentially malicious activities or unauthorized changes to the kernel's module configuration. The generated audit events assist in tracking module-related actions on the system. It tracks using binaries like: insmod, modprobe, rmmod and kernel logs including: finit_module, init_module, delete_module", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://192.168.190.200:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-360s", "rule_id": "90695480-1395-49c9-b048-3c02378a4eac", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": [], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-auditd.log-default*"], "query": "//any where auditd.log.key: \"*modules*\" and\nany where event.module: \"auditd\"", "filters": [], "actions": []}