{"id":"4025ca10-6425-11ee-9f2d-bd3097ef4d0a","updated_at":"2024-01-08T08:54:09.410Z","updated_by":"elastic","created_at":"2023-10-06T08:49:27.321Z","created_by":"elastic","name":"NETXP User Account Creation Outside Bussines Hours","tags":["Domain: Endpoint","OS: Windows","Use Case: Threat Detection","Tactic: Persistence","Resources: Investigation Guide","Data Source: Elastic Endgame"],"interval":"10m","enabled":false,"revision":4,"description":"Identifies attempts to create new users outside of bussines hours. This is sometimes done by attackers to increase access or establish persistence on a system or domain. Higher priority than simple user creation.","risk_score":99,"severity":"critical","note":"tak jak w User Account Creation. TODO - uzupełnić dodatkowe kroki","license":"BIJZTW","output_index":"","meta":{"from":"5m","kibana_siem_app_url":"https://10.7.1.125:5601/app/security"},"author":["Dawid Przyczyna"],"false_positives":[],"from":"now-900s","rule_id":"c6188efc-de47-46dc-a8e1-4d5f2733d6f8","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","technique":[{"reference":"https://attack.mitre.org/techniques/T1136","name":"Create Account","subtechnique":[{"reference":"https://attack.mitre.org/techniques/T1087/001","name":"Local Account","id":"T1087.001"}],"id":"T1136"}],"tactic":{"reference":"https://attack.mitre.org/tactics/TA0003","name":"Persistence","id":"TA0003"}}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","data_view_id":"logs-*","query":" ((host.os.type: \"windows\" AND event.type: \"start\" AND (process.name: \"net.exe\" OR process.name: \"net1.exe\") AND NOT process.parent.name: \"net.exe\" AND process.args: \"user\" AND (process.args: \"/ad\" OR process.args: \"/add\")) OR (winlog.event_id: \"4720\"))","filters":[{"$state":{"store":"appState"},"meta":{"negate":false,"index":"logs-*","alias":null,"disabled":false,"type":"combined","params":[{"meta":{"field":"hour_of_day","negate":false,"index":"logs-*","alias":null,"disabled":false,"params":{"lt":"5","gte":"0"},"type":"range","value":{"lt":"5","gte":"0"},"key":"hour_of_day"},"query":{"range":{"hour_of_day":{"lt":"5","gte":"0"}}}},{"meta":{"field":"hour_of_day","negate":false,"index":"logs-*","alias":null,"disabled":false,"params":{"lt":"23","gte":"18"},"type":"range","value":{"lt":"23","gte":"18"},"key":"hour_of_day"},"query":{"range":{"hour_of_day":{"lt":"23","gte":"18"}}}}],"relation":"OR"},"query":{}}],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
