{"id": "fbf596f0-9a88-11ee-9f2d-bd3097ef4d0a", "updated_at": "2024-03-04T09:48:06.971Z", "updated_by": "elastic", "created_at": "2023-12-14T13:59:26.935Z", "created_by": "Szymon Gluch", "name": "NETXP EQL Suspicious PrintSpooler Service Executable File Creation", "tags": ["Domain: Endpoint", "OS: Windows", "Use Case: Threat Detection"], "interval": "10m", "enabled": true, "revision": 5, "description": "Detects attempts to exploit privilege escalation vulnerabilities related to the Print Spooler service. For more information refer to the following CVE's - CVE-2020-1048, CVE-2020-1337 and CVE-2020-1300 and verify that the impacted system is patched.\nEdited to include spool driver directory.", "risk_score": 73, "severity": "high", "license": "", "output_index": "", "meta": {"from": "1m", "kibana_siem_app_url": "https://10.7.1.125:5601/app/security"}, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-660s", "rule_id": "fa44d998-a4fe-43fa-a9a1-0f0f2fe6c6d7", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [], "to": "now", "references": ["https://voidsec.com/cve-2020-1337-printdemon-is-dead-long-live-printdemon/ https://www.thezdi.com/blog/2020/7/8/cve-2020-1300-remote-code-execution-through-microsoft-windows-cab-files"], "version": 1, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["endgame-*", "filebeat-*", "logs-*", "winlogbeat-*"], "query": "\nfile where host.os.type == \"windows\" and event.type == \"creation\" and\n  process.name : \"spoolsv.exe\" and file.extension : \"dll\" and\n  file.path : (\"?:\\\\Windows\\\\System32\\\\*\", \"?:\\\\Windows\\\\SysWOW64\\\\*\") and\n  not file.path :\n    (\"?:\\\\WINDOWS\\\\SysWOW64\\\\PrintConfig.dll\",\n     \"?:\\\\WINDOWS\\\\system32\\\\x5lrs.dll\",\n     \"?:\\\\WINDOWS\\\\sysWOW64\\\\x5lrs.dll\",\n     \"?:\\\\WINDOWS\\\\system32\\\\PrintConfig.dll\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\UNIRES.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\UNIDRVUI.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\UNIDRV.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\PSCRIPT5.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\PS5UI.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\MXDWDRV.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\PJLMON.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\W32X86\\\\3\\\\New\\\\mxdwdrv.dll\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\FXSWZRD.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\FXSTIFF.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\FXSRES.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\FXSDRV.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\FXSAPI.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\FXSUI.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\PrintConfig.dll\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\W32X86\\\\3\\\\New\\\\PrintConfig.dll\",\n     \"?:\\\\WINDOWS\\\\system32\\\\spool\\\\DRIVERS\\\\x64\\\\3\\\\New\\\\PCL5URES.DLL\",\n     \"?:\\\\WINDOWS\\\\system32\\\\spool\\\\DRIVERS\\\\x64\\\\3\\\\New\\\\tsprint.dll\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\PCL5URES.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\drivers\\\\x64\\\\3\\\\New\\\\tsprint.dll\",\n     \"?:\\\\WINDOWS\\\\system32\\\\spool\\\\DRIVERS\\\\x64\\\\3\\\\New\\\\*.DLL\",\n     \"?:\\\\Windows\\\\System32\\\\spool\\\\*\\\\*.DLL\"\n)\n", "filters": [], "actions": []}
