{"id": "f1fc0c30-c402-11ee-b1a9-450725835cdc", "updated_at": "2024-02-05T08:59:02.415Z", "updated_by": "elastic", "created_at": "2024-02-05T08:45:42.400Z", "created_by": "elastic", "name": "NETXP Mounting Hidden or WebDav Remote Shares [Brodnica]", "tags": ["Domain: Endpoint", "OS: Windows", "Use Case: Threat Detection", "Tactic: Initial Access", "Tactic: Lateral Movement", "Data Source: Elastic Endgame", "Data Source: Elastic Defend"], "interval": "5m", "enabled": false, "revision": 2, "description": "Identifies the use of net.exe to mount a WebDav or hidden remote share. This may indicate lateral movement or preparation for data exfiltration.", "risk_score": 47, "severity": "medium", "license": "Elastic License v2", "output_index": "", "meta": {"from": "4m", "kibana_siem_app_url": ""}, "timestamp_override": "event.ingested", "timestamp_override_fallback_disabled": false, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-540s", "rule_id": "7050cfe3-c27a-475e-b798-92c27d404125", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [{"framework": "MITRE ATT&CK", "tactic": {"reference": "https://attack.mitre.org/tactics/TA0008/", "name": "Lateral Movement", "id": "TA0008"}, "technique": [{"reference": "https://attack.mitre.org/techniques/T1021/", "name": "Remote Services", "id": "T1021", "subtechnique": [{"reference": "https://attack.mitre.org/techniques/T1021/002/", "name": "SMB/Windows Admin Shares", "id": "T1021.002"}]}]}, {"framework": "MITRE ATT&CK", "tactic": {"reference": "https://attack.mitre.org/tactics/TA0001/", "name": "Initial Access", "id": "TA0001"}, "technique": [{"reference": "https://attack.mitre.org/techniques/T1078/", "name": "Valid Accounts", "id": "T1078", "subtechnique": [{"reference": "https://attack.mitre.org/techniques/T1078/003/", "name": "Local Accounts", "id": "T1078.003"}]}]}, {"framework": "MITRE ATT&CK", "tactic": {"reference": "https://attack.mitre.org/tactics/TA0007/", "name": "Discovery", "id": "TA0007"}, "technique": [{"reference": "https://attack.mitre.org/techniques/T1087/", "name": "Account Discovery", "id": "T1087", "subtechnique": [{"reference": "https://attack.mitre.org/techniques/T1087/001/", "name": "Local Account", "id": "T1087.001"}, {"reference": "https://attack.mitre.org/techniques/T1087/002/", "name": "Domain Account", "id": "T1087.002"}]}]}], "to": "now", "references": [], "version": 106, "exceptions_list": [], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["logs-endpoint.events.*", "winlogbeat-*", "logs-windows.*", "endgame-*"], "query": "process where host.os.type == \"windows\" and event.type == \"start\" and\n ((process.name : \"net.exe\" or process.pe.original_file_name == \"net.exe\") or ((process.name : \"net1.exe\" or process.pe.original_file_name == \"net1.exe\") and\n not process.parent.name : \"net.exe\")) and\n process.args : \"use\" and\n /* including hidden and webdav based online shares such as onedrive  */\n process.args : (\"\\\\\\\\*\\\\*$*\", \"\\\\\\\\*@SSL\\\\*\", \"http*\") and\n /* excluding shares deletion operation */\n not process.args : \"/d*\" and not process.args : \"*klasterFS\\\\Profile\\\\*\\\\Documents\\\\ESKULAP_TEMP\" /* wykluczam aplikacje szpitala, nie kopiowac do innych klient\u00f3w */", "filters": [], "actions": []}
