{"id": "ca620430-cb1f-11ee-b1a9-450725835cdc", "updated_at": "2024-02-26T09:07:35.869Z", "updated_by": "elastic", "created_at": "2024-02-14T09:59:49.493Z", "created_by": "elastic", "name": "NETXP Suspicious PrintSpooler Service Executable File Creation [Updated]", "tags": ["Domain: Endpoint", "OS: Windows", "Use Case: Threat Detection", "Tactic: Privilege Escalation", "Data Source: Elastic Endgame", "Use Case: Vulnerability", "Data Source: Elastic Defend"], "interval": "5m", "enabled": true, "revision": 3, "description": "Detects attempts to exploit privilege escalation vulnerabilities related to the Print Spooler service. For more information refer to the following CVE's - CVE-2020-1048, CVE-2020-1337 and CVE-2020-1300 and verify that the impacted system is patched.", "risk_score": 73, "severity": "high", "license": "Elastic License v2", "output_index": "", "meta": {"from": "4m", "kibana_siem_app_url": ""}, "timestamp_override": "event.ingested", "timestamp_override_fallback_disabled": false, "author": ["Szymon Gluch"], "false_positives": [], "from": "now-540s", "rule_id": "2ee2faf8-21f9-4f8b-8b97-4d01fd7359cc", "max_signals": 100, "risk_score_mapping": [], "severity_mapping": [], "threat": [{"framework": "MITRE ATT&CK", "technique": [{"reference": "https://attack.mitre.org/techniques/T1068/", "name": "Exploitation for Privilege Escalation", "subtechnique": [], "id": "T1068"}], "tactic": {"reference": "https://attack.mitre.org/tactics/TA0004/", "name": "Privilege Escalation", "id": "TA0004"}}], "to": "now", "references": ["https://voidsec.com/cve-2020-1337-printdemon-is-dead-long-live-printdemon/", "https://www.thezdi.com/blog/2020/7/8/cve-2020-1300-remote-code-execution-through-microsoft-windows-cab-files"], "version": 104, "exceptions_list": [{"list_id": "1dafae53-1cea-4be3-ae25-17429033ed1c", "namespace_type": "single", "id": "16b3b750-d0c7-11ee-b1a9-450725835cdc", "type": "rule_default"}], "immutable": false, "related_integrations": [], "required_fields": [], "setup": "", "type": "eql", "language": "eql", "index": ["winlogbeat-*", "logs-endpoint.events.*", "logs-windows.*", "endgame-*"], "query": "file where host.os.type == \"windows\" and event.type == \"creation\" and\n  process.name : \"spoolsv.exe\" and file.extension : \"dll\" and\n  file.path : (\"?:\\\\Windows\\\\System32\\\\*\", \"?:\\\\Windows\\\\SysWOW64\\\\*\") and\n  not file.path :\n          (\"?:\\\\WINDOWS\\\\SysWOW64\\\\PrintConfig.dll\",\n           \"?:\\\\WINDOWS\\\\system32\\\\x5lrs.dll\",\n           \"?:\\\\WINDOWS\\\\sysWOW64\\\\x5lrs.dll\",\n           \"?:\\\\WINDOWS\\\\system32\\\\PrintConfig.dll\", \"?:\\\\Windows\\\\system32\\\\spool\\\\DRIVERS\\\\*.DLL\")", "filters": [], "actions": []}
